
Звездный треугольник

Напишите программу, которая выводит указанный треугольник, состоящий из звездочек (*).
Тестовые данные 🟢

Sample Input:

Sample Output:

*
**
***
****
*****
******
*******

print("*")
print("**")
print("***")
print("****")
print("*****")
print("******")
print("*******")
