
Здравствуй, мир!

Напишите программу, которая выводит на экран текст «Здравствуй, мир!» (без кавычек).

Примечание 1. Проверяющая система будет сравнивать результат вашей программы и правильный ответ посимвольно. Это означает, что выводить нужно ровно такую строку, которая указана в условии задачи.

Примечание 2. Проверяющая система пользуется стандартным выводом (stdout, команда print()).
Тестовые данные 🟢

Sample Input:

Sample Output:

Здравствуй, мир!

print("Здравствуй, мир!")
