
Звездный прямоугольник

Напишите программу, которая выводит прямоугольник, по периметру состоящий из звездочек (*).

Примечание. Высота и ширина прямоугольника равны 444 и 171717 звёздочкам соответственно.

Sample Input:

Sample Output:

*****************
*               *
*               *
*****************

print("*****************")
print("*", "*", sep="               ")
print("*", "*", sep="               ")
print("*****************")
