

Напишите программу, которая выводит текст:

"Python is a great language!", said Fred. "I don't ever remember having this much fun before."

Примечание. Используйте конкатенацию строк.

Sample Input:

Sample Output:

"Python is a great language!", said Fred. "I don't ever remember having this much fun before."

a, b, c = '"Python is a great language!",', " said Fred.", ' "I don\'t ever remember having this much fun before."'
print(a + b + c)
