
Python is awesome

Напишите программу, которая выводит слова «Python is awesome!» (без кавычек) 10 раз.

Формат входных данных

Формат выходных данных
Программа должна вывести 10 раз текст «Python is awesome!», каждый на отдельной строке.

Sample Input:

Sample Output:

Python is awesome!
Python is awesome!
Python is awesome!
Python is awesome!
Python is awesome!
Python is awesome!
Python is awesome!
Python is awesome!
Python is awesome!
Python is awesome!

Напишите программу. Тестируется через stdin → stdout
Верно решили 30 764 учащихся
Из всех попыток 69% верных
Всё получилось!
Теперь вам доступен Форум решений , где вы можете сравнить свое решение с другими или спросить совета.

for i in range(10):
    print("Python is awesome!")
